# PlanCircuitSetIterator Properties

---
The PlanCircuitSetIterator type exposes the following members.
| Name| Description
---|---|---
| Current| Retrieves the item that is the current focus of the iterator.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
#### Reference
PlanCircuitSetIterator Class
Autodesk.Revit.DB Namespace